linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_1.mes_8.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 1 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 1001
[OVERALL], Throughput(ops/sec), 999.000999000999
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 8
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7992007992007992
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 0.7992007992007992
[READ], Operations, 477
[READ], AverageLatency(us), 470.27672955974845
[READ], MinLatency(us), 100
[READ], MaxLatency(us), 17535
[READ], 95thPercentileLatency(us), 965
[READ], 99thPercentileLatency(us), 2721
[READ], Return=OK, 477
[READ], Return=NOT_FOUND, 25
[UPDATE-FAILED], Operations, 16
[UPDATE-FAILED], AverageLatency(us), 668.0625
[UPDATE-FAILED], MinLatency(us), 160
[UPDATE-FAILED], MaxLatency(us), 6071
[UPDATE-FAILED], 95thPercentileLatency(us), 781
[UPDATE-FAILED], 99thPercentileLatency(us), 6071
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 700.0
[CLEANUP], MinLatency(us), 700
[CLEANUP], MaxLatency(us), 700
[CLEANUP], 95thPercentileLatency(us), 700
[CLEANUP], 99thPercentileLatency(us), 700
[UPDATE], Operations, 482
[UPDATE], AverageLatency(us), 1002.3236514522822
[UPDATE], MinLatency(us), 348
[UPDATE], MaxLatency(us), 14751
[UPDATE], 95thPercentileLatency(us), 2117
[UPDATE], 99thPercentileLatency(us), 4295
[UPDATE], Return=OK, 482
[UPDATE], Return=UNEXPECTED_STATE, 16
[READ-FAILED], Operations, 25
[READ-FAILED], AverageLatency(us), 265.8
[READ-FAILED], MinLatency(us), 87
[READ-FAILED], MaxLatency(us), 967
[READ-FAILED], 95thPercentileLatency(us), 384
[READ-FAILED], 99thPercentileLatency(us), 967