linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_180.mes_15.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 180 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 1112
[OVERALL], Throughput(ops/sec), 899.2805755395683
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 9
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.8093525179856115
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 9
[TOTAL_GC_TIME_%], Time(%), 0.8093525179856115
[READ], Operations, 470
[READ], AverageLatency(us), 94942.25106382978
[READ], MinLatency(us), 173
[READ], MaxLatency(us), 196607
[READ], 95thPercentileLatency(us), 189695
[READ], 99thPercentileLatency(us), 192127
[READ], Return=OK, 470
[READ], Return=NOT_FOUND, 10
[UPDATE-FAILED], Operations, 18
[UPDATE-FAILED], AverageLatency(us), 82954.16666666667
[UPDATE-FAILED], MinLatency(us), 431
[UPDATE-FAILED], MaxLatency(us), 191871
[UPDATE-FAILED], 95thPercentileLatency(us), 184959
[UPDATE-FAILED], 99thPercentileLatency(us), 191871
[CLEANUP], Operations, 180
[CLEANUP], AverageLatency(us), 6.916666666666667
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1053
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 29
[READ-FAILED], Operations, 10
[READ-FAILED], AverageLatency(us), 86358.4
[READ-FAILED], MinLatency(us), 137
[READ-FAILED], MaxLatency(us), 184831
[READ-FAILED], 95thPercentileLatency(us), 184831
[READ-FAILED], 99thPercentileLatency(us), 184831
[UPDATE], Operations, 502
[UPDATE], AverageLatency(us), 97381.36653386454
[UPDATE], MinLatency(us), 517
[UPDATE], MaxLatency(us), 199167
[UPDATE], 95thPercentileLatency(us), 190335
[UPDATE], 99thPercentileLatency(us), 195583
[UPDATE], Return=OK, 502
[UPDATE], Return=UNEXPECTED_STATE, 18