linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_240.mes_5.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 240 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 888
[OVERALL], Throughput(ops/sec), 1126.126126126126
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 2
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22522522522522523
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 2
[TOTAL_GC_TIME_%], Time(%), 0.22522522522522523
[READ], Operations, 480
[READ], AverageLatency(us), 117354.525
[READ], MinLatency(us), 163
[READ], MaxLatency(us), 254207
[READ], 95thPercentileLatency(us), 221567
[READ], 99thPercentileLatency(us), 244607
[READ], Return=OK, 480
[READ], Return=NOT_FOUND, 18
[UPDATE-FAILED], Operations, 17
[UPDATE-FAILED], AverageLatency(us), 108912.5294117647
[UPDATE-FAILED], MinLatency(us), 345
[UPDATE-FAILED], MaxLatency(us), 242815
[UPDATE-FAILED], 95thPercentileLatency(us), 223999
[UPDATE-FAILED], 99thPercentileLatency(us), 242815
[CLEANUP], Operations, 240
[CLEANUP], AverageLatency(us), 6.308333333333334
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1415
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 2
[UPDATE], Operations, 485
[UPDATE], AverageLatency(us), 129116.34845360825
[UPDATE], MinLatency(us), 470
[UPDATE], MaxLatency(us), 247295
[UPDATE], 95thPercentileLatency(us), 223615
[UPDATE], 99thPercentileLatency(us), 242303
[UPDATE], Return=OK, 485
[UPDATE], Return=UNEXPECTED_STATE, 17
[READ-FAILED], Operations, 18
[READ-FAILED], AverageLatency(us), 156997.38888888888
[READ-FAILED], MinLatency(us), 219
[READ-FAILED], MaxLatency(us), 238719
[READ-FAILED], 95thPercentileLatency(us), 233855
[READ-FAILED], 99thPercentileLatency(us), 238719