linear.measurement.postgres.update.original.v.1.27/postgres.op_update.threads_260.mes_2.dat
/usr/bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/conf:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/postgrenosql-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/checker-qual-3.31.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/postgresql-42.6.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-Not-Modified/postgrenosql/target/dependency/slf4j-simple-1.7.13.jar site.ycsb.Client -t -db site.ycsb.postgrenosql.PostgreNoSQLDBClient -P ./workloads/workloada -p recordcount=15585 -threads 260 -P ./postgrenosql/conf/postgrenosql.properties
[OVERALL], RunTime(ms), 851
[OVERALL], Throughput(ops/sec), 1175.0881316098707
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 6
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7050528789659225
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 0.7050528789659225
[READ], Operations, 487
[READ], AverageLatency(us), 107014.99178644764
[READ], MinLatency(us), 129
[READ], MaxLatency(us), 215807
[READ], 95thPercentileLatency(us), 206847
[READ], 99thPercentileLatency(us), 213119
[READ], Return=OK, 487
[READ], Return=NOT_FOUND, 18
[UPDATE-FAILED], Operations, 11
[UPDATE-FAILED], AverageLatency(us), 138309.45454545456
[UPDATE-FAILED], MinLatency(us), 175
[UPDATE-FAILED], MaxLatency(us), 217087
[UPDATE-FAILED], 95thPercentileLatency(us), 215935
[UPDATE-FAILED], 99thPercentileLatency(us), 217087
[CLEANUP], Operations, 260
[CLEANUP], AverageLatency(us), 6.246153846153846
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1483
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 9
[READ-FAILED], Operations, 18
[READ-FAILED], AverageLatency(us), 82112.83333333333
[READ-FAILED], MinLatency(us), 225
[READ-FAILED], MaxLatency(us), 196351
[READ-FAILED], 95thPercentileLatency(us), 175615
[READ-FAILED], 99thPercentileLatency(us), 196351
[UPDATE], Operations, 484
[UPDATE], AverageLatency(us), 139500.30991735536
[UPDATE], MinLatency(us), 418
[UPDATE], MaxLatency(us), 243199
[UPDATE], 95thPercentileLatency(us), 216831
[UPDATE], 99thPercentileLatency(us), 236031
[UPDATE], Return=OK, 484
[UPDATE], Return=UNEXPECTED_STATE, 11